//
//  Data.swift
//  15-hw2
//
//  Created by User19 on 2020/1/9.
//  Copyright © 2020 19. All rights reserved.
//

import Foundation

let leaders = [leader(name: "近平", country: "中國", intro:"習近平（1953年6月15日－），男，漢族， 中國共產黨、中華人民共和國政治人物。祖籍河南鄧州，籍貫陝西富平，生於北京。1969年畢業於清華大學化工系基本有機合成專業以及人文社會學院馬克思主義理論與思想政治教育專業，在職研究生學歷，法學博士學位。現任中國共產黨中央委員會總書記、中華人民共和國主席、中央軍事委員會主席。"),
               leader(name: "英文", country: "台灣", intro:"蔡英文（1956年8月31日－），中華民國政治人物、民主進步黨籍、法律學者、律師，為中華民國第14任總統，曾任民進黨主席。生於臺北市中山區，本籍屏東縣枋山鄉，是客家裔臺灣人和臺灣原住民族排灣族後裔。她先後獲得國立臺灣大學法律學系法學士、康奈爾法學院法學碩士、以及倫敦政治經濟學院法學博士，曾任教於國立政治大學法學院和東吳大學法學院。"),
               leader(name: "川普", country: "美國", intro:"唐納·約翰·川普（英語：Donald John Trump，1946年6月14日－）是美國政治人物及企業家，為第45任也是現任美國總統。他從政前，曾是商人和電視名人。川普於2019年12月18日因濫權和藐視國會而被眾議院彈劾。他是歷史上第三位被彈劾的美國總統。"),
               leader(name: "強森", country: "英國", intro:"亞歷山大·鮑里斯·德菲弗爾·強森（英語：Alexander Boris de Pfeffel Johnson，1964年6月19日－），英國保守黨籍政治人物，現任英國首相及保守黨領袖，也是一位通俗史學家和文學作家，早年曾任職於傳播媒體界，有報社記者、雜誌編輯、電視節目策劃等相關職務的工作經歷。強森曾於2001年至2008年期間在亨利選區擔任過國會議員，以及於2008年至2016年期間擔任過大倫敦市長，自2015年起獲選為阿克斯布里奇和南賴斯利普選區的國會議員，並在2016年7月至2018年7月期間任職過梅伊內閣中的外交及國協事務大臣，後於2019年7月下旬接替德蕾莎·梅伊出任英國首相及保守黨領袖。"),
               leader(name: "安倍", country: "日本", intro:"安倍晉三（日語：安倍 晋三／あべ しんぞう ，1954年9月21日－）是日本自由民主黨的政治家。現任日本國內閣總理大臣（第90、96-98任）、自由民主黨總裁（第21、25任），以及日本眾議院議員（連任9屆）。安倍晉三出生於日本東京都，祖籍山口縣大津郡油谷町（現今長門市）。其父親安倍晉太郎曾任外務大臣，是日本政治界的三大領袖之一，與竹下登、宮澤喜一並稱；其外祖父岸信介（原姓佐藤）及外叔公佐藤榮作亦曾任總理大臣，號稱「一家三宰相」"),
               leader(name: "普丁", country: "俄羅斯", intro:"佛拉迪米爾·佛拉迪米羅維奇·普丁（俄語：Влади́мир Влади́мирович Пу́тин，羅馬化：Vladímir Vladímirovic Pútin，IPA：[vɫɐˈdʲimʲɪr vɫɐˈdʲimʲɪrəvʲɪtɕ ˈputʲɪn]  聆聽，1952年10月7日－）是俄羅斯政治人物，出生於列寧格勒（今聖彼德堡），現任俄羅斯總統（第7任），曾任俄羅斯第7及11任俄羅斯總理、俄羅斯第2任總統與統一俄羅斯黨主席，更換職位均沒有離開過權力核心以及其在政府中的聲望頗大，故被外界認為是俄羅斯自2000年以來實際上的最高領導人。"),
               leader(name: "弗蘭克", country: "德國", intro:"法蘭克-華特·史坦麥爾（Frank-Walter Steinmeier，1956年1月5日－）是一名德國政壇人士，德意志聯邦共和國總統。他生於北萊茵-威斯伐倫州的德特摩德市，是德國社會民主黨內的一名重要人物。2005年出任德國總理梅克爾大聯合政府內閣的外交部長，2007年出任副總理。2013年第二次出任德國外交部長，繼續擔任外交部長直到當選德國總統。"),
               


]
